# St7GetInitialTemperatureInTHAFile

Returns the temperature used as the initial temperature in a transient heat result file.

long St7GetInitialTemperatureInTHAFile(long uID, char* FileName,
double* InitialTemp)
Input Parameters
uID
Strand7 model file ID.
FileName
Full path and name for the transient heat result file.
Output Parameters
InitialTemp
The initial temperature.

Solver – Quasi-static and Transient Dynamic